ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l211x_l112x/LFSS_1.0.xml
        </group>
    <register id="LFSS_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="EVT0_CFG" description="Event line mode 0 select" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. The software ISR clears the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode 1 select" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="LFSS_DESC" width="32" offset="0x10FC" description="LFSS Descriptor Register">
        <bitfield id="MINREV" description="Minor revision. This number holds the module revision and is incremented by the module developers. n = Minor module revision (see device-specific data sheet)" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major revision. This number holds the module revision and is incremented by the module developers. n = Major version (see device-specific data sheet)" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instantiated version. Describes which instance of the module accessed." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="INST0" value="0x0" description="This is the default, if there is only one instance - like for SSIM"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature set of this module. Differentiates the complexity of the actually instantiated module if there are differences." begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identifier. This ID is unique for each module. 0x2911 = Module ID of the LFSS Module" begin="31" end="16" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="LFSS_CLKCTL" width="32" offset="0x1100" description="RTC Clock Control Register">
        <bitfield id="MODCLKEN" description="This bit enables the supply of the 32kHz clock to the RTC. It will not power-up the 32kHz crystal oscillator this needs to be done in the Clock System Module." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="32kHz clock is not supplied to the RTC."/>
            <bitenum id="ENABLE" value="0x1" description="32kHz clock is supplied to the RTC."/>
        </bitfield>
    </register>
    <register id="LFSS_DBGCTL" width="32" offset="0x1104" description="RTC Module Debug Control Register">
        <bitfield id="DBGRUN" description="Debug Run." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="HALT" value="0x0" description="Counter is halted if CPU is in debug state."/>
            <bitenum id="RUN" value="0x1" description="Continue to operate normally ignoring the debug state of the CPU."/>
        </bitfield>
        <bitfield id="DBGINT" description="Debug Interrupt Enable." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Interrupts of the module will not be captured anymore if CPU is in debug state. Which means no update to the RTCRIS, RTCMISC and RTCIIDX register."/>
            <bitenum id="ON" value="0x1" description="Interrupts are enabled in debug mode. Interrupt requests are signaled to the interrupt controller. If the flags are required by software (polling mode) the DGBINT bit need to be set to 1."/>
        </bitfield>
    </register>
    <register id="LFSS_CTL" width="32" offset="0x1108" description="RTC Control Register">
        <bitfield id="RTCTEVTX" description="Real-time clock time event 0x0 = Minute changed 0x1 = Hour changed 0x2 = Every day at midnight (00:00) 0x3 = Every day at noon (12:00)" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="MINUTE" value="0x0" description="Generate RTC event every minute."/>
            <bitenum id="HOUR" value="0x1" description="Generate RTC event every hour."/>
            <bitenum id="MIDNIGHT" value="0x2" description="Generate RTC event at midnight."/>
            <bitenum id="NOON" value="0x3" description="Generate RTC event at noon."/>
        </bitfield>
        <bitfield id="RTCBCD" description="Real-time clock BCD select. Selects BCD counting for real-time clock." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BINARY" value="0x0" description="Binary code selected"/>
            <bitenum id="BCD" value="0x1" description="Binary coded decimal (BCD) code selected"/>
        </bitfield>
    </register>
    <register id="LFSS_STA" width="32" offset="0x110C" description="RTC Status Register">
        <bitfield id="RTCRDY" description="Real-time clock ready. This bit indicates when the real-time clock time values are safe for reading." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="RTC time values in transition"/>
            <bitenum id="READY" value="0x1" description="RTC time values safe for reading."/>
        </bitfield>
        <bitfield id="RTCTCRDY" description="Real-time clock temperature compensation ready. This is a read only bit that indicates when the RTCTCMPx can be written. Write to RTCTCMPx should be avoided when RTCTCRDY is reset." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="RTC temperature compensation in transition"/>
            <bitenum id="READY" value="0x1" description="RTC temperature compensation ready"/>
        </bitfield>
        <bitfield id="RTCTCOK" description="Real-time clock temperature compensation write OK. This is a read-only bit that indicates if the write to RTCTCMP is successful or not." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="NOT_OK" value="0x0" description="Write to RTCTCMPx is unsuccessful"/>
            <bitenum id="OK" value="0x1" description="Write to RTCTCMPx is successful"/>
        </bitfield>
    </register>
    <register id="LFSS_CAL" width="32" offset="0x1110" description="RTC Clock Offset Calibration Register">
        <bitfield id="RTCOCALX" description="Real-time clock offset error calibration. Each LSB represents approximately +1ppm (RTCOCALXS = 1) or -1ppm (RTCOCALXS = 0) adjustment in frequency. Maximum effective calibration value is +/-240ppm. Excess values written above +/-240ppm will be ignored by hardware." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="RTCOCALS" description="Real-time clock offset error calibration sign. This bit decides the sign of offset error calibration." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DOWN" value="0x0" description="Down calibration. Frequency adjusted down."/>
            <bitenum id="UP" value="0x1" description="Up calibration. Frequency adjusted up."/>
        </bitfield>
        <bitfield id="RTCCALFX" description="Real-time clock calibration frequency. Selects frequency output to RTCCLK pin for calibration measurement. The corresponding port must be configured for the peripheral module function." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="F32KHZ" value="0x0" description="32 kHz"/>
            <bitenum id="F512HZ" value="0x1" description="512 Hz"/>
            <bitenum id="F256HZ" value="0x2" description="256 Hz"/>
            <bitenum id="F1HZ" value="0x3" description="1 Hz"/>
        </bitfield>
    </register>
    <register id="LFSS_TCMP" width="32" offset="0x1114" description="RTC Temperature Compensation Register">
        <bitfield id="RTCTCMPX" description="Real-time clock temperature compensation. Value written into this register is used for temperature compensation of RTC. Each LSB represents approximately +1ppm (RTCTCMPS = 1) or -1ppm (RTCTCMPS = 0) adjustment in frequency. Maximum effective calibration value is +/-240ppm. Excess values written above +/-240ppm are ignored by hardware. Reading from RTCTCMP register at any time returns the cumulative value which is the signed addition of RTCOCALx and RTCTCMPX values, and the updated sign bit (RTCTCMPS) of the addition result." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="RTCTCMPS" description="Real-time clock temperature compensation sign. This bit decides the sign of temperature compensation." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DOWN" value="0x0" description="Down calibration. Frequency adjusted down."/>
            <bitenum id="UP" value="0x1" description="Up calibration. Frequency adjusted up."/>
        </bitfield>
    </register>
    <register id="LFSS_SEC" width="32" offset="0x1118" description="RTC Seconds Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="SECBIN" description="Seconds Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3B" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SECLOWBCD" description="Seconds BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="SECHIGHBCD" description="Seconds BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x5" description="Highest possible value"/>
        </bitfield>
    </register>
