ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l211x_l112x/LFSS_1.0.xml
    <register id="LFSS_TSMON" width="32" offset="0x1160" description="Time Stamp Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="MONBIN" description="Time Stamp Month Binary (1 to 12). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xC" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONLOWBCD" description="Time Stamp Month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MONHIGHBCD" description="Time Stamp Month BCD  high digit (0 or 1). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x1" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="LFSS_TSYEAR" width="32" offset="0x1164" description="Time Stamp Years Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="YEARLOWBIN" description="Time Stamp Year Binary  low byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARHIGHBIN" description="Time Stamp Year Binary  high byte. Valid values for Year are 0 to 4095. If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="YEARLOWESTBCD" description="Time Stamp Year BCD  lowest digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DECADEBCD" description="Time Stamp Decade BCD (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="23" end="20" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTLOWBCD" description="Time Stamp Century BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="27" end="24" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Highest possible value"/>
        </bitfield>
        <bitfield id="CENTHIGHBCD" description="Time Stamp Century BCD  high digit (0 to 4). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="30" end="28" width="3" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x4" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="LFSS_TSSTAT" width="32" offset="0x1168" description="Time Stamp Status Register">
        <bitfield id="TSTIOEVT0" description="Tamper I/O 0 caused time stamp event" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="no event detected"/>
            <bitenum id="SET" value="0x1" description="event detected"/>
        </bitfield>
        <bitfield id="TSVDDEVT" description="Loss of VDD caused time stamp event" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="CLR" value="0x0" description="no event detected"/>
            <bitenum id="SET" value="0x1" description="event detected"/>
        </bitfield>
    </register>
    <register id="LFSS_TSCTL" width="32" offset="0x116C" description="Time Stamp Control Register">
        <bitfield id="TSTIOEN0" description="Time Stamp by Tamper I/O 0 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSVDDEN" description="Time Stamp by VDD Loss detection enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSCAPTURE" description="Defines the capture method of the RTC timestamp when a time stamp event occurens." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="FIRST" value="0x0" description="Time stamp holds RTC capture at first occurrence of time stamp event."/>
            <bitenum id="LAST" value="0x1" description="Time stamp holds RTC capture at last occurrence of time stamp event."/>
        </bitfield>
    </register>
    <register id="LFSS_TSCLR" width="32" offset="0x1170" description="Time Stamp Clear Register">
        <bitfield id="CLR" description="Clear time stamp and status register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="clear time stamp event"/>
        </bitfield>
    </register>
    <register id="LFSS_LFSSRST" width="32" offset="0x11F0" description="Low frequency sub-system reset request">
        <bitfield id="VBATPOR" description="If set, the register bit will request a power on reset to the PMU of the LFSS." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing this value has no effect."/>
            <bitenum id="SET" value="0x1" description="Request power on reset to the LFSS."/>
        </bitfield>
    </register>
    <register id="LFSS_RTCLOCK" width="32" offset="0x11FC" description="Real time clock lock register">
        <bitfield id="PROTECT" description="If set, the register bit will protect the CLKCTL, SEC, MIN, HOUR, DAY, MON, YEAR and LFSSRST from accidental writes." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="RTC counter is writable."/>
            <bitenum id="SET" value="0x1" description="RTC counter is read only access."/>
        </bitfield>
    </register>
